#### Instalação das Bibliotecas necessárias.

In [10]:
import pandas as pd
import sqlalchemy

### Precisa instalar os conectores dos Bancos (pymysql, pymssql, sqlite)

#### Documentação do SQLAlchemy.

https://docs.sqlalchemy.org/en/latest/core/engines.html

#### Criando a Conexão ao MySQL

In [75]:
#engine = sqlalchemy.create_engine('mysql+pymysql://usuario:senha@localhost:3306/world')

**Conexão SQL Server**

In [4]:
# engine = sqlalchemy.create_engine('mssql+pymssql://usuario:senha@localhost:porta/banco')

**Conexão SQLite**

In [1]:
# engine = db.create_engine('sqlite:///census.sqlite')

## Método:  read_sql_table

#### Paramentros do método read_sql_table

* **table_name** = Nome da tabela onde será feita a leitura dos dados.
* **con** = Objeto conexão criado pelo SQLAlchemy.
* **schema**= Schema onde a tabela está armazenada.
* **index_col** = Coluna a ser definida como index.
<br>...

#### Lendo toda a tabela Employees e transformando em DataFrame.

In [18]:
df = pd.read_sql_table('city',engine)

#### Listando os dados e informações dos atributos.

In [19]:
df.head()

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4079 entries, 0 to 4078
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           4079 non-null   int64
 1   Name         4079 non-null   object
 2   CountryCode  4079 non-null   object
 3   District     4079 non-null   object
 4   Population   4079 non-null   int64
dtypes: int64(2), object(3)
memory usage: 159.5+ KB

**Lendo apenas algumas colunas da tabela.**

In [22]:
df = pd.read_sql_table('city', engine, columns=["Name","District"])

In [23]:
df.head()

             Name       District
0           Kabul          Kabol
1        Qandahar       Qandahar
2           Herat          Herat
3  Mazar-e-Sharif          Balkh
4       Amsterdam  Noord-Holland

## Método:  read_sql_query

#### Paramentros do método read_sql_query

* **sql** = String SQL Query que deverá ser executada para retornar o conjunto de dados.
* **con** = Objeto conexão criado pelo SQLAlchemy.
* **index_col** = Coluna a ser definida como index.
* **params**= Lista de parametros para serem passados ao método.
<br>...

#### Criando um DataFrame apartir de uma query ao banco de dados.

In [24]:
df = pd.read_sql_query("select * from city",engine)

In [25]:
df.head()

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

#### Criando um DataFrame apartir de uma query ao banco de dados utilizando a coluna emp_no com index.

In [28]:
df_index = pd.read_sql_query("select * from city",engine,index_col="ID")

In [29]:
df_index.head()

              Name CountryCode       District  Population
ID
1            Kabul         AFG          Kabol     1780000
2         Qandahar         AFG       Qandahar      237500
3            Herat         AFG          Herat      186800
4   Mazar-e-Sharif         AFG          Balkh      127800
5        Amsterdam         NLD  Noord-Holland      731200

#### Criando um DataFrame apartir de uma query ligando várias tabelas.

In [33]:
query = '''
SELECT 
    cout.Name, 
    cit.Name, 
    cit.CountryCode, 
    cit.District, 
    cit.Population,
    cl.CountryCode, 
    cl.Language, 
    cl.IsOfficial, 
    cl.Percentage
FROM 
	world.city as cit 
    left join world.country as cout on cout.Code = cit.CountryCode
    left join world.countrylanguage as cl on cl.CountryCode = cit.CountryCode
'''

In [34]:
df = pd.read_sql_query(query,engine)

In [35]:
df.head()

,Name,Name,CountryCode,District,Population,CountryCode,Language,IsOfficial,Percentage
0,Afghanistan,Kabul,AFG,Kabol,1780000,AFG,Balochi,F,0.9
1,Afghanistan,Kabul,AFG,Kabol,1780000,AFG,Dari,T,32.1
2,Afghanistan,Kabul,AFG,Kabol,1780000,AFG,Pashto,T,52.4
3,Afghanistan,Kabul,AFG,Kabol,1780000,AFG,Turkmenian,F,1.9
4,Afghanistan,Kabul,AFG,Kabol,1780000,AFG,Uzbek,F,8.8

#### Criando um DataFrame apartir de uma query utilizando parametros dinâmicos.

In [41]:
query = 'SELECT cit.Name, cit.CountryCode, cit.District, cit.Population ' \
        'FROM world.city as cit  ' \
        'WHERE cit.Name = %s'

In [42]:
df = pd.read_sql_query(query, engine,params=["Kabul"])

In [32]:
df.head()

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

#### Criando um DataFrame apartir de uma query utilizando parametros nomeados.

In [65]:
query = '''
SELECT 
    cout.Name, 
    cit.Name, 
    cit.CountryCode, 
    cit.District, 
    cit.Population,
    cl.CountryCode, 
    cl.Language, 
    cl.IsOfficial, 
    cl.Percentage
FROM 
	world.city as cit 
    left join world.country as cout on cout.Code = cit.CountryCode
    left join world.countrylanguage as cl on cl.CountryCode = cit.CountryCode
WHERE cit.Name = (cit_Name)
'''

In [66]:
df = pd.read_sql_query(query, 
                       engine,
                       params={'cit_Name':"Kabul"}
                      )

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
first_name          5 non-null object
last_name           5 non-null object
gender              5 non-null object
departament_name    5 non-null object
from_date           5 non-null object
to_date             5 non-null object
dtypes: object(6)
memory usage: 368.0+ bytes

In [67]:
df.head(20)

,Name,Name,CountryCode,District,Population,CountryCode,Language,IsOfficial,Percentage
0,Afghanistan,Kabul,AFG,Kabol,1780000,AFG,Balochi,F,0.9
1,Afghanistan,Kabul,AFG,Kabol,1780000,AFG,Dari,T,32.1
2,Afghanistan,Kabul,AFG,Kabol,1780000,AFG,Pashto,T,52.4
3,Afghanistan,Kabul,AFG,Kabol,1780000,AFG,Turkmenian,F,1.9
4,Afghanistan,Kabul,AFG,Kabol,1780000,AFG,Uzbek,F,8.8
5,Afghanistan,Qandahar,AFG,Qandahar,237500,AFG,Balochi,F,0.9
6,Afghanistan,Qandahar,AFG,Qandahar,237500,AFG,Dari,T,32.1
7,Afghanistan,Qandahar,AFG,Qandahar,237500,AFG,Pashto,T,52.4
8,Afghanistan,Qandahar,AFG,Qandahar,237500,AFG,Turkmenian,F,1.9
9,Afghanistan,Qandahar,AFG,Qandahar,237500,AFG,Uzbek,F,8.8
10,Afghanistan,Herat,AFG,Herat,186800,AFG,Balochi,F,0.9
11,Afghanistan,Herat,AFG,Herat,186800,AFG,Dari,T,32.1
12,Afghanistan,Herat,AFG,Herat,186800,AFG,Pashto,T,52.4
13,Afghanistan,Herat,AFG,Herat,186800,AFG,Turkmenian,F,1.9
14,Afghanistan,Herat,AFG,Herat,186800,AFG,Uzbek,F,8.8
15,Afghanistan,Mazar-e-Sharif,AFG,Balkh,127800,AFG,Balochi,F,0.9
16,Afghanistan,Mazar-e-Sharif,AFG,Balkh,127800,AFG,Dari,T,32.1
17,Afghanistan,Mazar-e-Sharif,AFG,Balkh,127800,AFG,Pashto,T,52.4
18,Afghanistan,Mazar-e-Sharif,AFG,Balkh,127800,AFG,Turkmenian,F,1.9
19,Afghanistan,Mazar-e-Sharif,AFG,Balkh,127800,AFG,Uzbek,F,8.8

## Método:  read_sql

#### Faz o roteamento entre os métodos read_table e read_sql_query.

#### Paramentros do método read_sql.

* **sql** = String SQL Query que deverá ser executada para retornar o conjunto de dados.
* **con** = Objeto conexão criado pelo SQLAlchemy.
* **index_col** = Coluna a ser definida como index.
* **params**= Lista de parametros para serem passados ao método.
<br>...

#### Criando o DataFrame passando apenas o nome da tabela para o método.

In [68]:
df = pd.read_sql("city",engine)

In [69]:
df.head()

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

#### Criando o DataFrame através de uma query.

In [70]:
df = pd.read_sql("SELECT * FROM city",engine)

In [71]:
df.head()

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

## Método:  to_sql

#### Escreve o DataFrame para o Banco de Dados Relacional.

#### Carregando a base de dados e criando o DataFrame.

In [72]:
df = pd.read_csv("dados/automobile.csv")

In [73]:
df.head()

   symboling normalized-losses         make fuel-type aspiration
0          3                 ?  alfa-romero       gas        std
1          3                 ?  alfa-romero       gas        std
2          1                 ?  alfa-romero       gas        std
3          2               164         audi       gas        std
4          2               164         audi       gas        std

#### Paramentros do método to_sql.

* **name** = Nome da tabela que será criada no SGBD.
* **con** = Objeto conexão criado pelo SQLAlchemy.
* **schema** = Nome do Schema onde será criada a tabela.
* **if_exists**= Comportamento caso a tabela exista no SGBD.
* **index**= Escreve o índice do DataFrame como uma coluna da tabela.
* **index_label**= Nome da coluna de índice.

**Criando a tabela no Banco de Dados a partir do DataFrame.**

In [74]:
df.to_sql(
    name = 'tb_automobile',
    con = engine,
)

**Criando a tabela no Banco de Dados sem a coluna de índice.**

In [79]:
df.to_sql(
    name = 'tb_automobile',
    con = engine,
    index = False,
    if_exists ='append'
)

**Visualizando os Detalhes da Tabela**

In [76]:
import sqlalchemy as db

**Conexão SQLite**

engine = db.create_engine('sqlite:///census.sqlite')

In [76]:
connection = engine.connect()
metadata = db.MetaData()
census = db.Table('census', metadata, autoload=True, autoload_with=engine)

In [76]:
# Equivalente a 'SELECT * FROM census'
query = db.select([census])

In [76]:
ResultProxy = connection.execute(query)

In [76]:
ResultSet = ResultProxy.fetchall()

In [76]:
ResultSet[:3]

**Filtrando data**

In [ ]:
# where

db.select([census]).where(census.columns.sex == 'F')

In [ ]:
# IN

db.select([census.columns.state, census.columns.sex]).where(census.columns.state.in_(['Texas', 'New York']))

In [ ]:
# and, or, not

db.select([census]).where(db.and_(census.columns.state == 'California', census.columns.sex != 'M'))

In [ ]:
# order by

db.select([census]).order_by(db.desc(census.columns.state), census.columns.pop2000)

In [ ]:
# functions

db.select([db.func.sum(census.columns.pop2008)])

In [ ]:
# other functions include avg, count, min, max…

db.select([db.func.sum(census.columns.pop2008).label('pop2008'), census.columns.sex]).group_by(census.columns.sex)

In [ ]:
# distinct

db.select([census.columns.state.distinct()])

**Criando a Tabela e inserindo dados**

In [78]:
import sqlalchemy as db
import pandas as pd

In [79]:
# # Criando Banco e tabela 

engine = db.create_engine('sqlite:///test.sqlite') #Create test.sqlite automatically
connection = engine.connect()
metadata = db.MetaData()

emp = db.Table('emp', metadata,
              db.Column('Id', db.Integer()),
              db.Column('name', db.String(255), nullable=False),
              db.Column('salary', db.Float(), default=100.0),
              db.Column('active', db.Boolean(), default=True)
              )

metadata.create_all(engine) #Criando a tablea

In [81]:
# Inserindo Dados

#Inserindo um registro
query = db.insert(emp).values(Id=1, name='naveen', salary=60000.00, active=True) 
ResultProxy = connection.execute(query)


#Inserindo vários registros
query = db.insert(emp) 
values_list = [{'Id':'2', 'name':'ram', 'salary':80000, 'active':False},
               {'Id':'3', 'name':'ramesh', 'salary':70000, 'active':True}]
ResultProxy = connection.execute(query,values_list)

results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name   salary  active
0   1  naveen  60000.0    True
1   2     ram  80000.0   False
2   3  ramesh  70000.0    True

**Atualizando Banco**

In [ ]:
# db.update(table_name).values(attribute = new_value).where(condition)

In [82]:
import sqlalchemy as db
import pandas as pd

In [83]:
engine = db.create_engine('sqlite:///test.sqlite')
metadata = db.MetaData()
connection = engine.connect()
emp = db.Table('emp', metadata, autoload=True, autoload_with=engine)

In [84]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name   salary  active
0   1  naveen  60000.0    True
1   2     ram  80000.0   False
2   3  ramesh  70000.0    True

In [87]:
# Atualizando o salario para 100000
query = db.update(emp).values(salary = 100000)
query = query.where(emp.columns.Id == 1)
results = connection.execute(query)

In [88]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name    salary  active
0   1  naveen  100000.0    True
1   2     ram   80000.0   False
2   3  ramesh   70000.0    True

**Apagando a Tabela**

In [89]:
# db.delete(table_name).where(condition)

In [90]:
import sqlalchemy as db
import pandas as pd

In [91]:
engine = db.create_engine('sqlite:///test.sqlite')
metadata = db.MetaData()
connection = engine.connect()
emp = db.Table('emp', metadata, autoload=True, autoload_with=engine)

In [92]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name    salary  active
0   1  naveen  100000.0    True
1   2     ram   80000.0   False
2   3  ramesh   70000.0    True

In [93]:
# Deletando salarios < 100000
query = db.delete(emp)
query = query.where(emp.columns.salary < 100000)
results = connection.execute(query)

In [94]:
results = connection.execute(db.select([emp])).fetchall()
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head(4)

   Id    name    salary  active
0   1  naveen  100000.0    True

**Droppando a Tabela.**

In [2]:
# table_name.drop(engine) #drops a single table
#metadata.drop_all(engine) #drops all the tables in the database